app/controllers/activities_controller.rb

INSERT INTO "activities" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "elo"], ["user_id", 1], ["created_at", "2016-04-18 00:03:22.101267"], ["updated_at", "2016-04-18 00:03:22.101267"]]
---
  def create
    puts params
    @activity = Activity.new(activity_params)

    respond_to do |format|
      if @activity.save