app/controllers/strategies_controller.rb

SELECT "strategies".* FROM "strategies"
---
  def index
    @strategies = Strategy.all

INSERT INTO "strategies" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    puts params
    @strategy = Strategy.new(strategy_params)

    respond_to do |format|
      if @strategy.save

SELECT  "strategies".* FROM "strategies" WHERE "strategies"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_strategy
      @strategy = Strategy.find(params[:id])